
action = 'Какое число больше или равно числа 17925 \nb = (34**2) \nc = (26*3) \nd = (17*33) \ne = (4394*4)'
print(action)

a = 17925 

b = (347**2)
c = (26*3)
d = (17*33)
e = (4394*4)

if a <= b:
	print('Число', b, 'больше или равно числа', a)

if a <= c:
	print('Число', c, 'больше или равно числа', a)


if a <= d:
	print('Число', d, 'больше или равно числа', a)


if a <= e:
	print('Число', e, 'больше или равно числа', a)

else:
	print('Ни одно из указанных чисел не больше или равен числу 17925')

	

